# SolidGeometryOptions Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
SolidGeometryOptions Class
Members See Also
---
A class containing optional information to control the geometry generation of the Solid by the SolidUtils routines.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2019
# Syntax
C#
---
```text
public class SolidGeometryOptions : IDisposable
```

Visual Basic
---
```text
Public Class SolidGeometryOptions _
	Implements IDisposable
```

Visual C++
---
```text
public ref class SolidGeometryOptions : IDisposable
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..SolidGeometryOptions
# See Also
SolidGeometryOptions Members
Autodesk.Revit.DB Namespace